apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
            err_code = fds_record_close(&record_desc);
            if (err_code != NRF_SUCCESS)
            {
                NRF_LOG_RAW_INFO("\n\t>> Error al cerrar el registro: 0x%X", err_code);
                return default_valor;
            }
        }
        else
        {
            NRF_LOG_RAW_INFO("\n\t>> Error al abrir el registro: 0x%X", err_code);
        }
    }
    else
    {
        NRF_LOG_RAW_INFO(
            "\n\t>> Registro no encontrado. Usando valor predeterminado: %u\n",
            default_valor);
    }

    return resultado;
}

#define APP_BLE_CONN_CFG_TAG           1

#define DEVICE_NAME                    "Repetidor"
#define NUS_SERVICE_UUID_TYPE          BLE_UUID_TYPE_VENDOR_BEGIN
#define APP_BLE_OBSERVER_PRIO          3
#define APP_ADV_INTERVAL               64
#define APP_ADV_DURATION               18000
#define MIN_CONN_INTERVAL              MSEC_TO_UNITS(20, UNIT_1_25_MS)
#define MAX_CONN_INTERVAL              MSEC_TO_UNITS(75, UNIT_1_25_MS)
#define SLAVE_LATENCY                  0
#define CONN_SUP_TIMEOUT               MSEC_TO_UNITS(4000, UNIT_10_MS)
#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000)
#define NEXT_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(30000)
#define MAX_CONN_PARAMS_UPDATE_COUNT   3
#define DEAD_BEEF                      0xDEADBEEF

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);
NRF_BLE_QWR_DEF(m_qwr);
BLE_ADVERTISING_DEF(m_advertising);

static app_nus_server_on_data_received_t m_on_data_received        = 0;
static uint16_t                          m_ble_nus_max_data_len    = BLE_GATT_ATT_MTU_DEFAULT - 3;
static uint16_t                          m_conn_handle             = BLE_CONN_HANDLE_INVALID;
static uint16_t                          m_emisor_conn_handle      = BLE_CONN_HANDLE_INVALID;
static uint8_t                           custom_mac_addr_[6]       = {0};
static uint8_t                           mac_address_from_flash[6] = {0};
static ble_uuid_t                        m_adv_uuids[]             = {
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};
static ble_gap_addr_t m_target_periph_addr;

static void           load_mac_from_flash(void)
{
    fds_record_desc_t  record_desc;
    fds_find_token_t   ftok = {0};
    fds_flash_record_t flash_record;

    // Busca el registro en la memoria flash
    ret_code_t err_code =
        fds_record_find(MAC_FILE_ID, MAC_RECORD_KEY, &record_desc, &ftok);
    if (err_code == NRF_SUCCESS)
    {
        err_code = fds_record_open(&record_desc, &flash_record);
        if (err_code == NRF_SUCCESS)
        {
            memcpy(mac_address_from_flash, flash_record.p_data,
                   sizeof(mac_address_from_flash));
            fds_record_close(&record_desc);
            NRF_LOG_RAW_INFO("\nMAC cargada desde memoria flash: "
                             "%02X:%02X:%02X:%02X:%02X:%02X",
                             mac_address_from_flash[0], mac_address_from_flash[1],
                             mac_address_from_flash[2], mac_address_from_flash[3],
                             mac_address_from_flash[4], mac_address_from_flash[5]);
        }
    }
    else
    {
        NRF_LOG_WARNING("No se encontro una MAC en la memoria flash. Usando valor "
                        "predeterminado.");
        // Si no se encuentra una MAC, usa una dirección predeterminada
        mac_address_from_flash[0] = 0x63;
        mac_address_from_flash[1] = 0x98;
        mac_address_from_flash[2] = 0x41;
        mac_address_from_flash[3] = 0xD3;
        mac_address_from_flash[4] = 0x03;
        mac_address_from_flash[5] = 0xFB;
    }
}

// Definición de la función
static void delete_old_records(void)
{
    fds_record_desc_t record_desc;
    fds_find_token_t  ftok = {0};

    // Busca y elimina todos los registros con el mismo File ID
    while (fds_record_find(MAC_FILE_ID, MAC_RECORD_KEY, &record_desc, &ftok) ==
           NRF_SUCCESS)
    {
        ret_code_t err_code = fds_record_delete(&record_desc);
        APP_ERROR_CHECK(err_code);
        NRF_LOG_INFO("Registro antiguo eliminado.");
    }

    // Llama a fds_gc() para realizar la recolección de basura
    ret_code_t err_code = fds_gc();
    APP_ERROR_CHECK(err_code);
}

// Función para realizar la recolección de basura
static void perform_garbage_collection(void)
{
    ret_code_t err_code = fds_gc();
    if (err_code == NRF_SUCCESS)
    {
        NRF_LOG_RAW_INFO("\n\t>> Recoleccion de basura completada.");
    }
    else
    {
        NRF_LOG_RAW_INFO("\n\t>> Error en la recoleccion de basura: %d", err_code);
    }
}

// Función para guardar la MAC en la memoria flash
static void save_mac_to_flash_and_reset(uint8_t *mac_addr)
{
    fds_record_t      record;
    fds_record_desc_t record_desc;
    fds_find_token_t  ftok = {0};
    uint32_t          aligned_data_buffer[2]; // 2 * 4 = 8 bytes

    memcpy(aligned_data_buffer, mac_addr, 6);

    // Configura el registro con la MAC
    record.file_id     = MAC_FILE_ID;
    record.key         = MAC_RECORD_KEY;
    record.data.p_data = aligned_data_buffer; // Apunta al buffer alineado

    record.data.length_words =
        (6 + sizeof(uint32_t) - 1) / sizeof(uint32_t); // (6 + 3) / 4 = 2

    // Realiza la recolección de basura si es necesario
    // perform_garbage_collection();

    // Si ya existe un registro, actualízalo
    if (fds_record_find(MAC_FILE_ID, MAC_RECORD_KEY, &record_desc, &ftok) ==
        NRF_SUCCESS)
    {
        if (fds_record_update(&record_desc, &record) == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\n> Actualizando la MAC en memoria flash.");
            // NVIC_SystemReset();  // Reinicia el dispositivo
        }
        else
        {
            NRF_LOG_ERROR("Error al actualizar la MAC en memoria flash. Con registro "
                          "existente.");
        }
    }
    else
    {
        // Si no existe, crea un nuevo registro
        ret_code_t ret = fds_record_write(&record_desc, &record);

        if (ret == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\nRegistro creado correctamente.");
        }
        else
        {
            NRF_LOG_ERROR("Error al crear el registro: %d", ret);
        }
    }
}

