apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                case 3: // Comando 03: Reiniciar el dispositivo
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 03 recibido: "
                                     "Reiniciando "
                                     "dispositivo...\n\n\n\n");
                    nrf_delay_ms(1000);
                    NVIC_SystemReset();

                    break;

                case 4: // Guardar tiempo de encendido
                {
                    if (p_evt->params.rx_data.length >=
                        6) // Verifica que haya datos suficientes
                    {
                        char     time_str[4] = {message[5], message[6], message[7], '\0'};
                        uint32_t time_in_seconds __attribute__((aligned(4))) =
                            atoi(time_str) * 1000;
                        if (time_in_seconds <= 666000)
                        {
                            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 04 recibido: "
                                             "Cambiar tiempo de encendido \x1b[0m");
                            write_time_to_flash(TIEMPO_ENCENDIDO, time_in_seconds);
                        }
                        else
                        {
                            NRF_LOG_WARNING("El tiempo de encendido excede el máximo "
                                            "permitido (666 segundos).");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Comando 04 recibido con datos insuficientes.");
                    }
                    break;
                }

                case 5: // Comando 05: Leer tiempo de encendido desde la
                    // memoria flash
                    {
                        NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 05 recibido: "
                                         "Leer tiempo de encendido \x1b[0m");
                        uint32_t sleep_time_ms = read_time_from_flash(
                            TIEMPO_ENCENDIDO, DEFAULT_DEVICE_ON_TIME_MS);

                        break;
                    }

                case 6: // Comando 06: Guardar tiempo de apagado
                {
                    if (p_evt->params.rx_data.length >=
                        6) // Verifica que haya datos suficientes
                    {
                        char     time_str[4] = {message[5], message[6], message[7], '\0'};
                        uint32_t time_in_seconds __attribute__((aligned(4))) =
                            atoi(time_str) * 1000;
                        if (time_in_seconds <= 6666000) // Verifica que no exceda el máximo
                        // permitido
                        {
                            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 06 recibido: "
                                             "Cambiar tiempo de dormido \x1b[0m");
                            write_time_to_flash(TIEMPO_SLEEP, time_in_seconds);
                        }
                        else
                        {
                            NRF_LOG_WARNING("El tiempo de dormido excede el máximo "
                                            "permitido (6666 segundos).");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Comando 06 recibido con datos insuficientes.");
                    }
                    break;
                }

                case 7: // Comando 07: Leer tiempo de apagado desde la
                    // memoria flash
                    {
                        NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 07 recibido: "
                                         "Leer tiempo de dormido\x1b[0m");
                        uint32_t sleep_time_ms = read_time_from_flash(
                            TIEMPO_SLEEP, DEFAULT_DEVICE_SLEEP_TIME_MS);

                        break;
                    }

                case 8: // Comando 08: Escribe en la memoria flash la fecha y
                        // hora, formato YYYYMMDDHHMMSS
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 08 recibido: Guardar "
                                     "fecha y hora\x1b[0m");

                    if (p_evt->params.rx_data.length >=
                        19) // 5 de comando + 14 de fecha/hora
                    {
                        const char *fecha_iso =
                            &message[5]; // Apunta al inicio de la fecha/hora

                        datetime_t dt;
                        if (sscanf(fecha_iso, "%4hu%2hhu%2hhu%2hhu%2hhu%2hhu", &dt.year,
                                   &dt.month, &dt.day, &dt.hour, &dt.minute,
                                   &dt.second) == 6)
                        {
                            NRF_LOG_RAW_INFO("\nFecha recibida: "
                                             "%04u-%02u-%02u %02u:%02u:%02u",
                                             dt.year, dt.month, dt.day, dt.hour, dt.minute,
                                             dt.second);

                            // Llamar a la función modificada
                            ret_code_t err = write_date_to_flash(&dt);

                            if (err != NRF_SUCCESS)
                            {
                                NRF_LOG_ERROR("Error guardando: 0x%X", err);
                            }
                        }
                        else
                        {
                            NRF_LOG_WARNING("Formato inválido. Se esperaba "
                                            "YYYYMMDDHHMMSS.");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Datos insuficientes. Se esperaban 14 dígitos");
                    }
                    break;
                }
                case 9: // Comando 09: Leer fecha y hora almacenada en flash
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 09 recibido: Leer fecha "
                                     "y hora\x1b[0m");

                    // Leer fecha de la memoria flash
                    datetime_t dt = read_date_from_flash();

                    // Mostrar fecha leída
                    NRF_LOG_RAW_INFO(
                        "\n>> Fecha almacenada: %04u-%02u-%02u %02u:%02u:%02u", dt.year,
                        dt.month, dt.day, dt.hour, dt.minute, dt.second);

                    break;
                }
                default: // Comando desconocido
                    NRF_LOG_WARNING("Comando desconocido: %s", command);
                    break;
                }
            }
            else
            {
                // Reenvía el mensaje al emisor o lo maneja normalmente
                if (m_on_data_received)
                {
                    m_on_data_received((uint8_t *)message, p_evt->params.rx_data.length);
                }
            }
        }
        else
        {
            NRF_LOG_WARNING("Mensaje demasiado largo para procesar.");
        }
    }
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code                          = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

